[
    {
        "_id": "Medvault",
        "name": "Medvault",
        "image": "MedVault.png",
        "language": "HTML, CSS",
        "framework": "React Bootstrap, MongoDB",
        "figma": "https://www.figma.com/design/2dmxep7Y5Yl2hF7fu8zGvq/Vital-Hacks?node-id=57-11&t=ItkdOAgyeWFFAPYS-1",
        "github" : "https://github.com/IsabellaB876/vital-hacks.git",
        "description": "MedVault is a web platform designed to streamline document management for users in the medical field, including both doctors and patients. Doctors can securely request medical documents from their patients, who in turn can easily upload and submit the necessary files directly through the platform.", 
        "problem": "The problem this website aims to solve is the challenge of file organization and timely document submission within the medical field. Patients often struggle to understand which documents are required by their doctors and may submit important files late or not at all. This platform is designed to streamline the submission process, ensuring that critical medical documents are organized and submitted to healthcare providers on time.",
        "key_features": "When a patient uploads and submits a medical document, the AI system verifies whether all required fields have been properly filled out. If any fields are missing, an error message is displayed, clearly indicating which specific fields need attention. If the document is complete, the AI confirms successful submission. Additionally, if the patient accidentally uploads the wrong document, the AI detects the error and notifies the user, prompting them to upload the correct one.",
        "challenges": "One of the main challenges we faced during this project was coordinating a time when the entire team could work together. Since the project spanned both the spring and summer semesters, it became especially difficult to collaborate over the summer, as many team members were in different states or countries, often across various time zones. Despite these obstacles, our team remained committed. We communicated effectively through FaceTime calls and shared detailed notes to ensure everyone stayed on track, regardless of location. Another significant challenge was working with a new framework. Prior to this project, I had only developed using standard React applications. However, this website was built using React Bootstrap, which introduced a different approach. Unlike plain React, Bootstrap provides pre-built components that simplify UI development. For example, when building the document upload feature for patients, we used a dropdown menu—a component already available in Bootstrap. Initially, I spent time manually creating components from scratch, only to later realize that Bootstrap offered built-in solutions. This led to some unnecessary delays, but it was a valuable learning experience in understanding how to use frameworks more efficiently.",
        "development": "We began by brainstorming design ideas for the wireframes. Once the design concepts were finalized, we moved on to creating the high-fidelity prototype. After that, we transitioned into development, dividing tasks among team members. I was responsible for building the frontend of the homepage and implementing its core functionality. While some parts of the website are still in progress, we are nearing completion. Full development will continue throughout the Fall semester."
    },
    {
        "_id": "Cornish",
        "name": "Cornish Commons",
        "image": "Cornish.png",
        "language": "None",
        "framework": "Figma",
        "figma": "https://www.figma.com/proto/ijTFMrPs29yPT0JsIVE0Ik/Cornish-College-Revision?node-id=1-340&p=f&t=YBFG0Yjv6Dezqy8Q-1&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=1%3A340",
        "github" : "None",
        "description": "Given the assingment to improve the user experience of the Cornish Commons website.", 
        "problem": "Users reported confusion with the website’s navigation, especially during the checkout process. Many found the flow between pages unintuitive and disorienting. Specifically, when attempting to pay for a class, the site often led users in circles without clear direction. The checkout process lacked indicators or progress cues, leaving users unsure of where they were or what steps remained to complete their purchase.",
        "key_features": "Implemented a progress bar in the checkout process to improve user clarity. The progress bar provides a clear visual indicator of each step, helping users understand where they are in the checkout flow and what remains to complete their purchase. ",
        "challenges": "At the start of the project, reaching certain users proved difficult. To overcome this, I maintained consistent communication efforts, using multiple channels — including email and phone — to ensure responses. Additionally, this was my first time working with Figma, and getting comfortable with the interface was initially challenging. I addressed this by actively seeking guidance from teammates and friends who had more experience, which allowed me to quickly improve my skills and contribute effectively to the design process.",
        "development": "By interviewing a diverse group of users, we identified two primary issues: confusing navigation between pages and inconsistent course information. After pinpointing these core problems, our team conducted brainstorming sessions to generate potential solutions. We then translated these ideas into wireframes and developed low-fidelity prototypes to test initial concepts. Once a design direction was refined, we created a high-fidelity prototype and presented the final design to the Cornish team."
    },
    {
        "_id": "Eventura",
        "name": "Eventura",
        "image": "",
        "language": "N/A",
        "framework": "Figma",
        "figma": "In the progress of being desinged in Figma",
        "github" : "None",
        "description": "A website that helps user find events near them and that matches their prefrences", 
        "problem": "Many people struggle to discover professional or recreational events happening nearby. This website/app aims to solve that problem by curating and presenting local events tailored to users' interests and locations.",
        "key_features": "N/A",
        "challenges": "N/A",
        "development": "N/A"
    }
]